Simulations/MEXICO/Simulations-Mar20/V0_2.1s/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// Molecular viscosity
nu              nu [0 2 -1 0 0 0 0] 1.45274e-05;

// Reference temperature
TRef                TRef [0 0 0 1 0 0 0] 287.59;

// the following 3 quantities being called, although I don't use it!
// need to check the original bBPF
// Laminar Prandtl number
Pr              Pr [0 0 0 0 0 0 0] 0.9;

// Turbulent Prandtl number
Prt             Prt [0 0 0 0 0 0 0] 0.7;


// Thermal expansion coefficient
beta            beta [0 0 0 -1 0 0 0] 3e-03;

// Constants for Monin-Obuhkov universal constants
//betaM               16.0;
//gammM               5.0;

// Roughness height
z0                  z0 [0 1 0 0 0 0 0] 0.016;

// Surface temperature flux
q0                  q0 [0 1 -1 1 0 0 0] 0.0;

// Surface stress model (options are "Schummann", "Moeng", or "MoengCorrected")
surfaceStressModel "Moeng";

// Wei-Brasseur surface stress model correction beta parameter
betaSurfaceStress  -0.125;


// ************************************************************************* //
